{"pageProps":{"post":{"id":17,"assetRoot":"2020/07/10/site-release","thumbnail":null,"title":"Finally live!","description":"Yay!","slug":"site-release","date":"2020-07-10T18:48:00.000Z","content":"<p>My website is now live! Actually, it’s been live for a few days by now, I’m just a bit late to make the post. As you can see, it’s not completely done, but don’t worry, I’ll still be pushing new updates and content to it.</p>\n<p>There’s a few posts before this that I wrote while the website was in development. Please feel free to look at those as well.</p>\n<h2 id=\"semantic-versioning\">Semantic Versioning</h2>\n<p>My release versions are on a semantic versioning system.</p>\n<img src=\"/_/2020/07/10/site-release/semver.png\" alt=\"Semantic versioning takes the form of major.minor.patch\">\n<p>We are currently in major version <code>0</code>, which I will consider the “beta” phase. The website doesn’t have all the bells and whistles that I want it to have, but I will slowly add more as we go along. When I reach a version that I consider to be extremely user friendly and it shows off everything I want it to show off, I will call that major version <code>1</code>, or the “release” phase.</p>\n<h2 id=\"roadmap-for-the-near-future\">Roadmap for the near future</h2>\n<p>In version 0.2, I will make mostly infrastructural changes to my website, but I will improve on some of the user-facing website features as well.</p>\n<ul>\n<li>\n<p>I’m completely throwing out my current monolithic Gatsby configuration and replacing it with a more modular, advanced, and type-safe configuration that leverages modular plugins, TypeScript, and GraphQL type checking. I won’t be adding much content as a result of this change, except for perhaps a blog post explaining how it works, unfortunately, but it <em>will</em> make my life a lot easier and make content easier to produce in the future.</p>\n</li>\n<li>\n<p>I will redesign the portfolio page to be more user-friendly.</p>\n<ul>\n<li>I’ll add a sidebar with filtering options so that you can select specific tags to view.</li>\n<li>I’ll attempt to also reduce the download size as well, so that users don’t have to download as much data when viewing it.</li>\n</ul>\n</li>\n<li>\n<p>Going along with the portfolio page, I will also improve on the project detail pages as well, hopefully integrating it with the outer portfolio page.</p>\n</li>\n<li>\n<p>And finally, as always, bugfixes when I find them. Or, when <em>you</em> find them and report them to <a href=\"https://github.com/astralbijection/astrid.tech/issues\">the issues page</a>.</p>\n</li>\n</ul>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>That just about sums up my plans. I will release another post when <code>0.2</code> comes out. Thank you, and please stay tuned!</p>","tags":["/projects/astrid-tech/","gatsby-js"]}},"__N_SSG":true}