{"pageProps":{"post":{"id":12,"assetRoot":"2020/11/14","thumbnail":null,"title":"Brewing Kombucha","description":"FizzBuzz but without the Buzz","slug":"kombucha","date":"2020-11-14T00:00:00.000Z","content":"<p>And now for something completely different.</p>\n<p>I first tried kombucha back in spring, and it was absolutely not what I expected. It was fizzy, sweet, and it had a little bit of a nice sour taste to even it out. Like soda, if it had probiotics in it!</p>\n<p>So a few weeks ago, I decided to try making my own kombucha for the first time! It’s as simple as just throwing stuff into a jar and letting the microorganisms do their thing… right?</p>\n<h2 id=\"a-possibly-incorrect-crash-course-on-kombucha\">A possibly incorrect crash course on Kombucha</h2>\n<p>Here is a summary of my limited understanding of kombucha.</p>\n<ul>\n<li>Kombucha gets made when <strong>SCOBY</strong> (<strong>S</strong>ymbiotic <strong>C</strong>ulture <strong>O</strong>f <strong>B</strong>acteria and <strong>Y</strong>east), or a bunch of microorganisms, are used to ferment tea (specifically <em>Camellia sinensis</em>) and sugar.</li>\n<li>You can get a <strong>pellicle</strong>, which lots of people <em>think</em> is the SCOBY, but in reality, it’s just a bunch of celluose that the SCOBY generates during fermentation.\n<ul>\n<li>There is SCOBY on the pellicle, but pellicle <span class=\"math math-inline\"><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo mathvariant=\"normal\">≠</mo></mrow><annotation encoding=\"application/x-tex\">\\neq</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"mrel\"><span class=\"mrel\"><span class=\"mord vbox\"><span class=\"thinbox\"><span class=\"rlap\"><span class=\"strut\" style=\"height:0.8888799999999999em;vertical-align:-0.19444em;\"></span><span class=\"inner\"><span class=\"mord\"><span class=\"mrel\"></span></span></span><span class=\"fix\"></span></span></span></span></span><span class=\"mrel\">=</span></span></span></span></span></span> SCOBY. The pellicle is apparently edible, too.</li>\n</ul>\n</li>\n</ul>\n<p>There are two fermentation steps:</p>\n<ol>\n<li>\n<p>First fermentation (<strong>F1</strong>)</p>\n<ul>\n<li>You grow SCOBY with tea, plain sugar, and kombucha from your last batch.</li>\n<li>Supplying a pellicle is optional but recommended.</li>\n<li>Takes 7-14 days.</li>\n<li>Ends up with sour probiotic water and usually a pellicle.</li>\n<li>You can drink it if you want.</li>\n</ul>\n</li>\n<li>\n<p>Second fermentation, (<strong>F2</strong>)</p>\n<ul>\n<li>You take F1 results and add flavoring.</li>\n<li>Takes 2-4 days.</li>\n<li>Ends up with carbonated fruity probiotic water.</li>\n<li>If you add yeast at this step it becomes alcoholic.</li>\n</ul>\n</li>\n</ol>\n<p>Unfortunately, since I’m just starting out, there is no last batch. But that’s what health food stores are for!</p>\n<h2 id=\"spooky-halloween-preparation-day\">Spooky Halloween Preparation Day</h2>\n<p>As the sun set on All Hallow’s Eve, I started brewing my evil concoction. First, I acquired the following ingredients:</p>\n<ul>\n<li>A bottle of <a href=\"https://gtslivingfoods.com/offering/synergy-kombucha/original-enlightened/\">GT’s Original Kombucha</a> from a local Mollie Stone’s</li>\n<li>Organic brown cane sugar</li>\n<li>2 Lipton Tea bags</li>\n</ul>\n<img src=\"/_/2020/11/14/2020-10-31-starter-kombucha.jpg\" alt=\"Left to right: mason jar, starter kombucha, and kettle\">\n<p>There was already a mini-pellicle inside the kombucha, which according to some other internet people happens often enough.</p>\n<img src=\"/_/2020/11/14/2020-10-31-starter-pellicle.jpg\" alt=\"Mini pellicle inside the starter\">\n<p>I brewed the Lipton tea inside the mason jar and threw in “enough” sugar, plus some agave syrup for good measure. Should I have measured out my additions accurately? Probably, to be honest. But I didn’t, and just like with everything else I cook, it seems to have turned out fine despite my lack of precision! I waited for the tea to cool down to 85°F before throwing in the starter.</p>\n<img src=\"/_/2020/11/14/2020-10-31-thermometer.jpg\" alt=\"Waiting to cool down.\">\n<p>I poured in about a third of the starter and drank the rest. I hadn’t had kombucha in a while, and it tasted pretty good!</p>\n<p>I let it sit in a shelf for the first fermentation and went back to being busy with schoolwork. The green stuff next to it is an attempt at hot sauce that… didn’t go so well, I’ll just say.</p>\n<img src=\"/_/2020/11/14/2020-10-31-shelf.jpg\" alt=\"Kombucha, next to hot sauce destined to fail.\">\n<h2 id=\"first-fermentation\">First Fermentation</h2>\n<p>On day 6 mark, it was looking decently healthy, but the air was getting colder and colder.</p>\n<img src=\"/_/2020/11/14/2020-11-05-progress.jpg\" alt=\"Progress, more like poggers\">\n<p>Here’s what it looked like on the 8 day mark.</p>\n<img src=\"/_/2020/11/14/2020-11-07-progress.jpg\" alt=\"Poggers, more like pog\">\n<p>But at this point, our poorly insulated house got kinda cold. 60°F cold. So cold that in the mornings, I had to lay in bed for many minutes to gather my willpower to get up, because I’m a flimsy temperature-sensitive stick. If it were just me that was like that, then it would be fine, but unfortunately, so is SCOBY. I had to figure out a way to keep it a bit warmer, or else the SCOBY wouldn’t be very happy.</p>\n<h3 id=\"shitty-idea-time\">Shitty Idea Time</h3>\n<p>You see, on the part of the shelf that is under my desk, there are a pair of old computers that I’m using as “servers,” though I haven’t had the time to actually use them very much so they’re mostly acting like heaters.</p>\n<img src=\"/_/2020/11/14/server-shelf.jpg\" alt=\"The hellworld that is my underdesk.\">\n<p>The shelf right above it was empty and at 75°F, and we all know what happens to hot air…</p>\n<img src=\"/_/2020/11/14/incubator.jpg\" alt=\"Brings a whole new meaning to &#x22;tech incubator&#x22;\">\n<p>That’s right! Brewing vessels get placed in hot air!</p>\n<p>And by day 12, a thin pellicle had formed!</p>\n<img src=\"/_/2020/11/14/2020-11-11-progress.jpg\" alt=\"It&#x27;s totally not sitting on a subwoofer behind a monitor or anything janky like that.\">\n<p>And by day 13, I gave it a taste, and it was wonderfully sour. I decided it was ready for second fermentation!</p>\n<h2 id=\"second-fermentation\">Second Fermentation</h2>\n<p>Now that I knew that this kombucha fermentation was possible, I made sure to prepare the next F1.</p>\n<img src=\"/_/2020/11/14/2020-11-12-nextbatch.jpg\" alt=\"Preparing the next F1.\">\n<p>I took the pellicle and about a third of the first batch and put it in the new kombucha so that I can make more. I thawed and crushed some frozen blueberries and threw it into the other two thirds. I also added a small amount of honey to both because I felt like it.</p>\n<img src=\"/_/2020/11/14/2020-11-12-nextbatch2.jpg\" alt=\"Generation 1 F2 next to generation 2 F1.\">\n<p>And I put it back on the server incubator.</p>\n<h2 id=\"bottling\">Bottling</h2>\n<p>I saw bubbles in the jar and was really happy, and I decided to bottle my kombucha! Unfortunately, it didn’t look as bubbly as I was expecting, but I proceeded to bottle it anyway because I felt like it. I strained out all the mush, spooned the final mixture into a bottle, and refrigerated it.</p>\n<img src=\"/_/2020/11/14/2020-11-14-straining.jpg\" alt=\"Straining.\">\n<img src=\"/_/2020/11/14/2020-11-14-bottle.jpg\" alt=\"Bottled!\">\n<p>I gave it a bit of a taste, and to my surprise, it tasted really good, and it was way fizzier than it looked! The fizziness surprised me so much that I actually spat some of it out a bit, even!</p>\n<p>It turns out in the end, I was a massive idiot and fermented for only 35 hours when I probably should have been aiming for 48. I’ve been losing track of time due to school and work! If I did it longer, perhaps it might be more outwardly fizzy, but whatever. Anyways, if I don’t die of septic shock within the next 48 hours as my mother has been warning me, I’ll deem this experiment a success!</p>\n<p>EDIT on 2020-11-15: I have not gotten septic shock.</p>","tags":["kombucha","notes"]}},"__N_SSG":true}